Revit 2024 API
Family.StructuralSectionShape Property
 The family's structural section shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public StructuralSectionShape StructuralSectionShape { get; set; }
Visual Basic
Public Property StructuralSectionShape As StructuralSectionShape
	Get
	Set
Visual C++
public:
property StructuralSectionShape StructuralSectionShape {
	StructuralSectionShape get ();
	void set (StructuralSectionShape value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: This Family cannot have a structural section.
See Also
Family Class
Autodesk.Revit.DB Namespace